/* 1) if/else გამოყენებით დაწერეთ კოდი , რომელიც ითვლის რიცხვის კვადრატს და ამოწმებს, თუ რიცხვის კვადრატი
 მეტია 100, კონსოლში გამოიტანოს მეტია ასზე და თუ ნაკლებია გამიტანოს ნაკლებია ასზე.
 */

 
let num = 21;

if(typeof num !== "number") {
    console.log("არ არის რიცხვი")
} else if(num * num > 100) {
    console.log("რიცხვი მეტია 100-ზე")
} else {
    console.log("არ არის 100-ზე მეტი")
}
 

/* 
2) შექმენით number ცვლადი და მიანიჭეთ ნებისმიერი რიცხვის მნიშვნელობა , შემდეგ if/else
 გამოყენებით შეამოწმეთ ეს რიცხვი არის თუ არა 50-ზე მეტი და 100-ზე ნაკლები. კონსოლში 
 გამოიტანეთ შესაბამისი პასუხი. */

 let number = 85; 

if(typeof number !== "number" ){
    console.log("არ არის რიცხვი.")
} else if (number > 50 && number < 100) {
    console.log("რიცხვი მეტია 50-ზე და ნაკლებია 100-ზე.")
} else{
    console.log("50-ზე ნაკლებია/ტოლია ან 100-ზე მეტია/ტოლია.")
} 


/* 
3)შექმენით number ცვლადი და მიანიჭეთ ნებისმიერი რიცხვის მნიშვნელობა, შემდეგ დაწერეთ კოდი, რომელიც ამოწმებს,
არის თუ არა რიცხვი ნულის ტოლი ან უარყოფითი და დააბრუნეთ შესაბამისი პასუხი. */

let number1 = "33";

if(typeof number1 !== "number") {
    console.log("არ არის რიცხვი.")
} else if(number1 > 0) {
    console.log("რიცხვი დადებითია.")
} else{
    console.log("რიცხვი ტოლია 0-ის/უარყოფითია.")
}








































































